import matplotlib.pyplot as plt
x = [1001, 1101, 1201, 1301, 1401, 1501, 1601, 1701, 1801, 1901, 2001]
y1 = [60.26, 82.06, 84.62, 80.22, 92.67, 103.08, 112.63, 119.19, 131.03, 139.74, 149.79]
y2 = [47.94, 52.19, 58.37, 65.52, 72.09, 78.74, 84.47, 91.92, 100.03, 113.39, 118.70]
y3 = [50.10, 51.47, 56.40, 58.47, 66.95, 72.21, 75.29, 81.92, 88.27, 95.82, 100.36]
# Построение графика
plt.xlabel("Размер матрицы")
plt.ylabel("Время выполнения")
plt.plot(x, y1, label = "Стандартный")
plt.plot(x, y2, label = "Алгоритм Винограда")
plt.plot(x, y3, label = "Оптимизированный алгоритм Винограда")
plt.legend()
plt.show()
