import matplotlib.pyplot as plt
x = [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]
y1 = [15.93, 64.08, 144.54, 255.18, 461.18, 572.16, 781.53, 1021.14, 1278.14, 1548.43]
y2 = [8.25, 31.54, 69.75, 125.15, 193.58, 275.23, 374.32, 491.75, 620.09, 762.50]
y3 = [1.82, 3.94, 6.19, 8.68, 11.19, 13.86, 16.27, 19.17, 21.45, 24.36]
# Построение графика
plt.xlabel("Размер массива")
plt.ylabel("Время выполнения")
plt.plot(x, y1, label = "Сортировка пузырьком")
plt.plot(x, y2, label = "Сортировка выбором")
plt.plot(x, y3, label = "Быстрая сортировка")
plt.legend()
plt.show()
